Student Enrollment, 2001-2021
students enrollmed for credit

In [1]:
import pandas as pd
import datetime as dt
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

Fall enrollment reports
File name: ef

Step 1: 
1. Upload files

In [2]:
fte_2002 = pd.read_csv("fte_2002.csv",low_memory=False)
cols = ['unitid','institution name','year','student fte']
fte_2002.columns = cols
fte_2002.columns = fte_2002.columns.str.lower()
fte_2002['year'] = 2002
fte_2002.head(2)

   unitid                    institution name  year  student fte
0  100636  Community College of the Air Force  2002          NaN
1  100654            Alabama A & M University  2002       5260.0

In [3]:
fte_2003 = pd.read_csv("fte_2003.csv",low_memory=False)
cols = ['unitid','institution name','year','student fte']
fte_2003.columns = cols
fte_2003.columns = fte_2003.columns.str.lower()
fte_2003['year'] = 2003
fte_2003.head(2)

   unitid                    institution name  year  student fte
0  100636  Community College of the Air Force  2003          NaN
1  100654            Alabama A & M University  2003       5881.0

In [4]:
fte_2004 = pd.read_csv("fte_2004.csv",low_memory=False)
cols = ['unitid','institution name','year','student fte']
fte_2004.columns = cols
fte_2004.columns = fte_2004.columns.str.lower()
fte_2004['year'] = 2004
fte_2004.head(2)

   unitid                    institution name  year  student fte
0  100636  Community College of the Air Force  2004          NaN
1  100654            Alabama A & M University  2004       5627.0

In [5]:
fte_2005 = pd.read_csv("fte_2005.csv",low_memory=False)
cols = ['unitid','institution name','year','student fte']
fte_2005.columns = cols
fte_2005.columns = fte_2005.columns.str.lower()
fte_2005['year'] = 2005
fte_2005.head(2)

   unitid                    institution name  year  student fte
0  100636  Community College of the Air Force  2005          NaN
1  100654            Alabama A & M University  2005       5497.0

In [6]:
fte_2006 = pd.read_csv("fte_2006.csv",low_memory=False)
cols = ['unitid','institution name','year','student fte']
fte_2006.columns = cols
fte_2006.columns = fte_2006.columns.str.lower()
fte_2006['year'] = 2006
fte_2006.head(2)

   unitid                    institution name  year  student fte
0  100636  Community College of the Air Force  2006          NaN
1  100654            Alabama A & M University  2006       5417.0

In [7]:
fte_2007 = pd.read_csv("fte_2007.csv",low_memory=False)
cols = ['unitid','institution name','year','student fte']
fte_2007.columns = cols
fte_2007.columns = fte_2007.columns.str.lower()
fte_2007['year'] = 2007
fte_2007.head(2)

   unitid                    institution name  year  student fte
0  100636  Community College of the Air Force  2007          NaN
1  100654            Alabama A & M University  2007       5124.0

In [8]:
fte_2008 = pd.read_csv("fte_2008.csv",low_memory=False)
cols = ['unitid','institution name','year','student fte']
fte_2008.columns = cols
fte_2008.columns = fte_2008.columns.str.lower()
fte_2008['year'] = 2008
fte_2008.head(2)

   unitid                     institution name  year  student fte
0  100654             Alabama A & M University  2008       4629.0
1  100663  University of Alabama at Birmingham  2008      13041.0

In [9]:
fte_2009 = pd.read_csv("fte_2009.csv",low_memory=False)
cols = ['unitid','institution name','year','student fte']
fte_2009.columns = cols
fte_2009.columns = fte_2009.columns.str.lower()
fte_2009['year'] = 2009
fte_2009.head(2)

   unitid                    institution name  year  student fte
0  100636  Community College of the Air Force  2009          NaN
1  100654            Alabama A & M University  2009       4796.0

In [10]:
fte_2010 = pd.read_csv("fte_2010.csv",low_memory=False)
cols = ['unitid','institution name','year','student fte']
fte_2010.columns = cols
fte_2010.columns = fte_2010.columns.str.lower()
fte_2010['year'] = 2010
fte_2010.head(2)

   unitid                    institution name  year  student fte
0  100636  Community College of the Air Force  2010          NaN
1  100654            Alabama A & M University  2010       5325.0

In [11]:
fte_2011 = pd.read_csv("fte_2011.csv",low_memory=False)
cols = ['unitid','institution name','year','student fte']
fte_2011.columns = cols
fte_2011.columns = fte_2011.columns.str.lower()
fte_2011['year'] = 2011
fte_2011.head(2)

   unitid                    institution name  year  student fte
0  100636  Community College of the Air Force  2011          NaN
1  100654            Alabama A & M University  2011       4495.0

In [12]:
fte_2012 = pd.read_csv("fte_2012.csv",low_memory=False)
cols = ['unitid','institution name','year','student fte']
fte_2012.columns = cols
fte_2012.columns = fte_2012.columns.str.lower()
fte_2012['year'] = 2012
fte_2012.head(2)

   unitid                    institution name  year  student fte
0  100636  Community College of the Air Force  2012          NaN
1  100654            Alabama A & M University  2012       4455.0

In [13]:
fte_2013 = pd.read_csv("fte_2013.csv",low_memory=False)
cols = ['unitid','institution name','year','student fte']
fte_2013.columns = cols
fte_2013.columns = fte_2013.columns.str.lower()
fte_2013['year'] = 2013
fte_2013.head(2)

   unitid                     institution name  year  student fte
0  100654             Alabama A & M University  2013       4660.0
1  100663  University of Alabama at Birmingham  2013      14482.0

In [14]:
fte_2014 = pd.read_csv("fte_2014.csv",low_memory=False)
cols = ['unitid','institution name','year','student fte']
fte_2014.columns = cols
fte_2014.columns = fte_2014.columns.str.lower()
fte_2014['year'] = 2014
fte_2014.head(2)

   unitid                    institution name  year  student fte
0  100636  Community College of the Air Force  2014          NaN
1  100654            Alabama A & M University  2014       4925.0

In [15]:
fte_2015 = pd.read_csv("fte_2015.csv",low_memory=False)
cols = ['unitid','institution name','year','student fte']
fte_2015.columns = cols
fte_2015.columns = fte_2015.columns.str.lower()
fte_2015['year'] = 2015
fte_2015.head(2)

   unitid                     institution name  year  student fte
0  100654             Alabama A & M University  2015       4863.0
1  100663  University of Alabama at Birmingham  2015      14305.0

In [16]:
fte_2016 = pd.read_csv("fte_2016.csv",low_memory=False)
cols = ['unitid','institution name','year','student fte']
fte_2016.columns = cols
fte_2016.columns = fte_2016.columns.str.lower()
fte_2016['year'] = 2016
fte_2016.head(2)

   unitid                     institution name  year  student fte
0  100654             Alabama A & M University  2016       5354.0
1  100663  University of Alabama at Birmingham  2016      15309.0

In [17]:
fte_2017 = pd.read_csv("fte_2017.csv",low_memory=False)
cols = ['unitid','institution name','year','student fte']
fte_2017.columns = cols
fte_2017.columns = fte_2017.columns.str.lower()
fte_2017['year'] = 2017
fte_2017.head(2)

   unitid                     institution name  year  student fte
0  100654             Alabama A & M University  2017       5589.0
1  100663  University of Alabama at Birmingham  2017      16471.0

In [18]:
fte_2018 = pd.read_csv("fte_2018.csv",low_memory=False)
cols = ['unitid','institution name','year','student fte']
fte_2018.columns = cols
fte_2018.columns = fte_2018.columns.str.lower()
fte_2018['year'] = 2018
fte_2018.head(2)

   unitid                     institution name  year  student fte
0  100654             Alabama A & M University  2018       5727.0
1  100663  University of Alabama at Birmingham  2018      17165.0

In [19]:
fte_2019 = pd.read_csv("fte_2019.csv",low_memory=False)
cols = ['unitid','institution name','year','student fte']
fte_2019.columns = cols
fte_2019.columns = fte_2019.columns.str.lower()
fte_2019['year'] = 2019
fte_2019.head(2)

   unitid                     institution name  year  student fte
0  100654             Alabama A & M University  2019       5801.0
1  100663  University of Alabama at Birmingham  2019      17454.0

In [20]:
fte_2020 = pd.read_csv("fte_2020.csv",low_memory=False)
cols = ['unitid','institution name','year','student fte']
fte_2020.columns = cols
fte_2020.columns = fte_2020.columns.str.lower()
fte_2020['year'] = 2020
fte_2020.head(2)

   unitid                     institution name  year  student fte
0  100654             Alabama A & M University  2020       5530.0
1  100663  University of Alabama at Birmingham  2020      17804.0

In [21]:
fte_2021 = pd.read_csv("fte_2021.csv",low_memory=False)
cols = ['unitid','institution name','year','student fte']
fte_2021.columns = cols
fte_2021.columns = fte_2021.columns.str.lower()
fte_2021['year'] = 2021
fte_2021.head(2)

   unitid                     institution name  year  student fte
0  100654             Alabama A & M University  2021       5416.0
1  100663  University of Alabama at Birmingham  2021      17721.0

In [25]:
master = pd.concat([fte_2002,fte_2003,fte_2004,fte_2005,fte_2006,fte_2007,fte_2008,fte_2009,fte_2010,fte_2011,fte_2012,fte_2013,fte_2014,fte_2015,fte_2016,fte_2017,fte_2018,fte_2019,fte_2020,fte_2021],ignore_index=False)
master.head()

#print(merge2.groupby('year')['unitid'].nunique())

   unitid                     institution name  year  student fte
0  100636   Community College of the Air Force  2002          NaN
1  100654             Alabama A & M University  2002       5260.0
2  100663  University of Alabama at Birmingham  2002      12353.0
3  100690                   Amridge University  2002        459.0
4  100706  University of Alabama in Huntsville  2002       5281.0

In [26]:
master = master.drop(['institution name'], axis=1)
master.head()

   unitid  year  student fte
0  100636  2002          NaN
1  100654  2002       5260.0
2  100663  2002      12353.0
3  100690  2002        459.0
4  100706  2002       5281.0

In [27]:
print(master.groupby('year')['unitid'].nunique())

year
2002    7439
2003    7021
2004    6915
2005    7013
2006    7048
2007    7050
2008    6273
2009    7313
2010    7488
2011    7642
2012    7735
2013    7764
2014    7687
2015    7647
2016    7521
2017    7121
2018    6857
2019    6527
2020    6440
2021    6273
Name: unitid, dtype: int64

In [28]:
#ef_merge = pd.concat([ef_2001,ef_2002,ef_2003,ef_2004,ef_2005,ef_2006,ef_2007,ef_2008,ef_2009,ef_2010,ef_2011,ef_2012,ef_2013,ef_2014,ef_2015,ef_2016,ef_2017,ef_2018,ef_2019,ef_2020,ef_2021],ignore_index=False)
#ef_merge.info()

Export to master merge folder:

In [30]:
master.to_csv('/Users/ellenruthconnell/Documents/INFO_696/2_merge/student_enrollment_fte_master.csv',index=False)